In [1]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.master("local").appName("spark-dataframe").getOrCreate()
spark

Using Spark's default log4j profile: org/apache/spark/log4j-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
23/11/16 10:43:40 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

# Spark DataFrame 생성
- csv를 불러와서 생성

In [2]:
filepath = "/home/ubuntu/working/spark-examples/data/titanic_train.csv"

# inferSchema 사용
titanic_sdf = spark.read.csv(filepath, inferSchema=True, header=True)
titanic_sdf.dtypes

[('PassengerId', 'int'),
 ('Survived', 'int'),
 ('Pclass', 'int'),
 ('Name', 'string'),
 ('Sex', 'string'),
 ('Age', 'double'),
 ('SibSp', 'int'),
 ('Parch', 'int'),
 ('Ticket', 'string'),
 ('Fare', 'double'),
 ('Cabin', 'string'),
 ('Embarked', 'string')]

In [4]:
titanic_sdf.printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

In [5]:
titanic_sdf.show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|
|         14|       0|     3|Andersson, Mr. An...|  male|39.0|    1|    5|          347082| 31.275| null|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| null|       S|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|          382652| 29.125| null|       Q|
|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|          244373|   13.0| null|       S|
|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| null|       S|
|         20|       1|     3|Masselmani, Mrs. ...|female|null|    0|    0|            2649|  7.225| null|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

# Pandas Dataframe 생성

In [6]:
import pandas as pd

titanic_pdf = pd.read_csv(filepath)
titanic_pdf.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
titanic_sdf.head(5)

[Row(PassengerId=1, Survived=0, Pclass=3, Name='Braund, Mr. Owen Harris', Sex='male', Age=22.0, SibSp=1, Parch=0, Ticket='A/5 21171', Fare=7.25, Cabin=None, Embarked='S'),
 Row(PassengerId=2, Survived=1, Pclass=1, Name='Cumings, Mrs. John Bradley (Florence Briggs Thayer)', Sex='female', Age=38.0, SibSp=1, Parch=0, Ticket='PC 17599', Fare=71.2833, Cabin='C85', Embarked='C'),
 Row(PassengerId=3, Survived=1, Pclass=3, Name='Heikkinen, Miss. Laina', Sex='female', Age=26.0, SibSp=0, Parch=0, Ticket='STON/O2. 3101282', Fare=7.925, Cabin=None, Embarked='S'),
 Row(PassengerId=4, Survived=1, Pclass=1, Name='Futrelle, Mrs. Jacques Heath (Lily May Peel)', Sex='female', Age=35.0, SibSp=1, Parch=0, Ticket='113803', Fare=53.1, Cabin='C123', Embarked='S'),
 Row(PassengerId=5, Survived=0, Pclass=3, Name='Allen, Mr. William Henry', Sex='male', Age=35.0, SibSp=0, Parch=0, Ticket='373450', Fare=8.05, Cabin=None, Embarked='S')]

In [8]:
print(titanic_pdf)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [9]:
print(titanic_sdf)

DataFrame[PassengerId: int, Survived: int, Pclass: int, Name: string, Sex: string, Age: double, SibSp: int, Parch: int, Ticket: string, Fare: double, Cabin: string, Embarked: string]

In [10]:
# Spark -> Pandas df로 변환
# - 분산 처리 시스템으로 분석 후, 시각화 필요할 때

titanic_sdf.toPandas()  # toPandas() : Action

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,None,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"""Johnston, Miss. Catherine Helen """"Carrie""""""",female,NaN,1,2,W./C. 6607,23.4500,None,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,None,Q

In [11]:
# describe()
# - pandas df의 통계정보 확인. 숫자에 대해서만 통계
titanic_pdf.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [13]:
titanic_sdf.describe().show()

+-------+-----------------+-------------------+------------------+--------------------+------+------------------+------------------+-------------------+------------------+-----------------+-----+--------+
|summary|      PassengerId|           Survived|            Pclass|                Name|   Sex|               Age|             SibSp|              Parch|            Ticket|             Fare|Cabin|Embarked|
+-------+-----------------+-------------------+------------------+--------------------+------+------------------+------------------+-------------------+------------------+-----------------+-----+--------+
|  count|              891|                891|               891|                 891|   891|               714|               891|                891|               891|              891|  204|     889|
|   mean|            446.0| 0.3838383838383838| 2.308641975308642|                null|  null| 29.69911764705882|0.5230078563411896|0.38159371492704824|260318.54916792738| 32.2042079685746| null|    null|
| stddev|257.3538420152301|0.48659245426485753|0.8360712409770491|                null|  null|14.526497332334035|1.1027434322934315| 0.8060572211299488|471609.26868834975|49.69342859718089| null|    null|
|    min|                1|                  0|                 1|"Andersson, Mr. A...|female|              0.42|                 0|                  0|            110152|              0.0|  A10|       C|
|    max|              891|                  1|                 3|van Melkebeke, Mr...|  male|              80.0|                 8|                  6|         WE/P 5735|         512.3292|    T|       S|
+-------+-----------------+-------------------+------------------+--------------------+------+------------------+------------------+-------------------+------------------+-----------------+-----+--------+

In [14]:
# 데이터 선택
titanic_pdf[["PassengerId", "Name"]]

     PassengerId                                               Name
0              1                            Braund, Mr. Owen Harris
1              2  Cumings, Mrs. John Bradley (Florence Briggs Th...
2              3                             Heikkinen, Miss. Laina
3              4       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4              5                           Allen, Mr. William Henry
..           ...                                                ...
886          887                              Montvila, Rev. Juozas
887          888                       Graham, Miss. Margaret Edith
888          889           Johnston, Miss. Catherine Helen "Carrie"
889          890                              Behr, Mr. Karl Howell
890          891                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [15]:
titanic_sdf.select(["PassengerId", "Name"]).show()

+-----------+--------------------+
|PassengerId|                Name|
+-----------+--------------------+
|          1|Braund, Mr. Owen ...|
|          2|Cumings, Mrs. Joh...|
|          3|Heikkinen, Miss. ...|
|          4|Futrelle, Mrs. Ja...|
|          5|Allen, Mr. Willia...|
|          6|    Moran, Mr. James|
|          7|McCarthy, Mr. Tim...|
|          8|Palsson, Master. ...|
|          9|Johnson, Mrs. Osc...|
|         10|Nasser, Mrs. Nich...|
|         11|Sandstrom, Miss. ...|
|         12|Bonnell, Miss. El...|
|         13|Saundercock, Mr. ...|
|         14|Andersson, Mr. An...|
|         15|Vestrom, Miss. Hu...|
|         16|Hewlett, Mrs. (Ma...|
|         17|Rice, Master. Eugene|
|         18|Williams, Mr. Cha...|
|         19|Vander Planke, Mr...|
|         20|Masselmani, Mrs. ...|
+-----------+--------------------+
only showing top 20 rows

In [17]:
# sdf에서 문자열 컬럼 제외하고 숫자형 컬럼에 대해서만 통계 정보 확인하기
# -> string 형식의 컬럼이 아니면 통계정보 보여주기
titanic_sdf.dtypes

[('PassengerId', 'int'),
 ('Survived', 'int'),
 ('Pclass', 'int'),
 ('Name', 'string'),
 ('Sex', 'string'),
 ('Age', 'double'),
 ('SibSp', 'int'),
 ('Parch', 'int'),
 ('Ticket', 'string'),
 ('Fare', 'double'),
 ('Cabin', 'string'),
 ('Embarked', 'string')]

In [22]:
num_cols = [column_name for column_name, column_type in titanic_sdf.dtypes if column_type != 'string']
num_cols

['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [23]:
titanic_sdf.select(num_cols).describe().show()

+-------+-----------------+-------------------+------------------+------------------+------------------+-------------------+-----------------+
|summary|      PassengerId|           Survived|            Pclass|               Age|             SibSp|              Parch|             Fare|
+-------+-----------------+-------------------+------------------+------------------+------------------+-------------------+-----------------+
|  count|              891|                891|               891|               714|               891|                891|              891|
|   mean|            446.0| 0.3838383838383838| 2.308641975308642| 29.69911764705882|0.5230078563411896|0.38159371492704824| 32.2042079685746|
| stddev|257.3538420152301|0.48659245426485753|0.8360712409770491|14.526497332334035|1.1027434322934315| 0.8060572211299488|49.69342859718089|
|    min|                1|                  0|                 1|              0.42|                 0|                  0|              0.0|
|    max|              891|                  1|                 3|              80.0|                 8|                  6|         512.3292|
+-------+-----------------+-------------------+------------------+------------------+------------------+-------------------+-----------------+

In [24]:
# shape
titanic_pdf.shape

(891, 12)

In [26]:
len(titanic_sdf.columns) # 열의 개수

12

In [27]:
titanic_sdf.count() # 행의 개수

891

# Spark DataFrame의 select() method
- `select` method는 SQL의 SELECT절과 매우 흡사
    - 한 개 이상의 컬럼들의 값을 **DataFrame** 형식으로 반환
- 한 개의 컬럼명 또는 여러 개의 컬럼명을 인자로 받을 수 있음
    - 개별 컬럼명을 문자열 형태로 또는 DataFrame의 컬럼 속성으로 지정
- DataFrame의 컬럼 속성으로 지정할 시에는 DataFrame.컬럼명, DataFrame[컬럼명], `col(컬럼명)`으로 지정

In [28]:
# Pandas df에서 단일 컬럼 값 가져오기 (시리즈 확인-1차원, 열벡터)
titanic_pdf["Name"]

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [29]:
# fancy indexing : 조회할 인덱스를 리스트에 넣어 놓고, 리스트로 조회하는 방식

col_names = ["Name", "Age"]
titanic_pdf[col_names]

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

In [30]:
# select는 Transformations
titanic_sdf.select("Name")

DataFrame[Name: string]

In [31]:
titanic_sdf.select("Name").show() # query > SELECT name FROM titanic_sdf

+--------------------+
|                Name|
+--------------------+
|Braund, Mr. Owen ...|
|Cumings, Mrs. Joh...|
|Heikkinen, Miss. ...|
|Futrelle, Mrs. Ja...|
|Allen, Mr. Willia...|
|    Moran, Mr. James|
|McCarthy, Mr. Tim...|
|Palsson, Master. ...|
|Johnson, Mrs. Osc...|
|Nasser, Mrs. Nich...|
|Sandstrom, Miss. ...|
|Bonnell, Miss. El...|
|Saundercock, Mr. ...|
|Andersson, Mr. An...|
|Vestrom, Miss. Hu...|
|Hewlett, Mrs. (Ma...|
|Rice, Master. Eugene|
|Williams, Mr. Cha...|
|Vander Planke, Mr...|
|Masselmani, Mrs. ...|
+--------------------+
only showing top 20 rows

In [32]:
titanic_sdf.select("Name", "Age").show() # 연산 불가능한 방식

+--------------------+----+
|                Name| Age|
+--------------------+----+
|Braund, Mr. Owen ...|22.0|
|Cumings, Mrs. Joh...|38.0|
|Heikkinen, Miss. ...|26.0|
|Futrelle, Mrs. Ja...|35.0|
|Allen, Mr. Willia...|35.0|
|    Moran, Mr. James|null|
|McCarthy, Mr. Tim...|54.0|
|Palsson, Master. ...| 2.0|
|Johnson, Mrs. Osc...|27.0|
|Nasser, Mrs. Nich...|14.0|
|Sandstrom, Miss. ...| 4.0|
|Bonnell, Miss. El...|58.0|
|Saundercock, Mr. ...|20.0|
|Andersson, Mr. An...|39.0|
|Vestrom, Miss. Hu...|14.0|
|Hewlett, Mrs. (Ma...|55.0|
|Rice, Master. Eugene| 2.0|
|Williams, Mr. Cha...|null|
|Vander Planke, Mr...|31.0|
|Masselmani, Mrs. ...|null|
+--------------------+----+
only showing top 20 rows

In [33]:
# 리스트 사용해서 Select
select_columns = ["Name", "Age", "Pclass", "Fare"]

In [35]:
# Fancy indexing을 spark df에서 활용 시
# - 구 버전과 신버전을 모두 지원하는 식으로 코딩 추천
# - - 구 버전 : select할 때 list 구조 사용 불가능. list 내 모든 컬럼의 이름이 언팩(Unpack)되어 있어야 함.

# 패킹된 리스트 확인
print(select_columns)

# 리스트 언패킹 - 구 버전
print(*select_columns)

['Name', 'Age', 'Pclass', 'Fare']
Name Age Pclass Fare

In [36]:
titanic_sdf.select(select_columns).show() # 신 버전
titanic_sdf.select(*select_columns).show() # 구 버전

+--------------------+----+------+-------+
|                Name| Age|Pclass|   Fare|
+--------------------+----+------+-------+
|Braund, Mr. Owen ...|22.0|     3|   7.25|
|Cumings, Mrs. Joh...|38.0|     1|71.2833|
|Heikkinen, Miss. ...|26.0|     3|  7.925|
|Futrelle, Mrs. Ja...|35.0|     1|   53.1|
|Allen, Mr. Willia...|35.0|     3|   8.05|
|    Moran, Mr. James|null|     3| 8.4583|
|McCarthy, Mr. Tim...|54.0|     1|51.8625|
|Palsson, Master. ...| 2.0|     3| 21.075|
|Johnson, Mrs. Osc...|27.0|     3|11.1333|
|Nasser, Mrs. Nich...|14.0|     2|30.0708|
|Sandstrom, Miss. ...| 4.0|     3|   16.7|
|Bonnell, Miss. El...|58.0|     1|  26.55|
|Saundercock, Mr. ...|20.0|     3|   8.05|
|Andersson, Mr. An...|39.0|     3| 31.275|
|Vestrom, Miss. Hu...|14.0|     3| 7.8542|
|Hewlett, Mrs. (Ma...|55.0|     2|   16.0|
|Rice, Master. Eugene| 2.0|     3| 29.125|
|Williams, Mr. Cha...|null|     2|   13.0|
|Vander Planke, Mr...|31.0|     3|   18.0|
|Masselmani, Mrs. ...|null|     3|  7.225|
+--------------------+----+------+-------+
only showing top 20 rows

+--------------------+----+------+-------+
|                Name| Age|Pclass|   Fare|
+--------------------+----+------+-------+
|Braund, Mr. Owen ...|22.0|     3|   7.25|
|Cumings, Mrs. Joh...|38.0|     1|71.2833|
|Heikkinen, Miss. ...|26.0|     3|  7.925|
|Futrelle, Mrs. Ja...|35.0|     1|   53.1|
|Allen, Mr. Willia...|35.0|     3|   8.05|
|    Moran, Mr. James|null|     3| 8.4583|
|McCarthy, Mr. Tim...|54.0|     1|51.8625|
|Palsson, Master. ...| 2.0|     3| 21.075|
|Johnson, Mrs. Osc...|27.0|     3|11.1333|
|Nasser, Mrs. Nich...|14.0|     2|30.0708|
|Sandstrom, Miss. ...| 4.0|     3|   16.7|
|Bonnell, Miss. El...|58.0|     1|  26.55|
|Saundercock, Mr. ...|20.0|     3|   8.05|
|Andersson, Mr. An...|39.0|     3| 31.275|
|Vestrom, Miss. Hu...|14.0|     3| 7.8542|
|Hewlett, Mrs. (Ma...|55.0|     2|   16.0|
|Rice, Master. Eugene| 2.0|     3| 29.125|
|Williams, Mr. Cha...|null|     2|   13.0|
|Vander Planke, Mr...|31.0|     3|   18.0|
|Masselmani, Mrs. ...|null|     3|  7.225|
+--------------------+----+------+-------+
only showing top 20 rows

In [37]:
titanic_sdf['Name']

Column<'Name'>

In [38]:
titanic_sdf.Name

Column<'Name'>

# 컬럼 속성 사용

In [39]:
titanic_sdf.select(
    titanic_sdf['Name']
).show()

+--------------------+
|                Name|
+--------------------+
|Braund, Mr. Owen ...|
|Cumings, Mrs. Joh...|
|Heikkinen, Miss. ...|
|Futrelle, Mrs. Ja...|
|Allen, Mr. Willia...|
|    Moran, Mr. James|
|McCarthy, Mr. Tim...|
|Palsson, Master. ...|
|Johnson, Mrs. Osc...|
|Nasser, Mrs. Nich...|
|Sandstrom, Miss. ...|
|Bonnell, Miss. El...|
|Saundercock, Mr. ...|
|Andersson, Mr. An...|
|Vestrom, Miss. Hu...|
|Hewlett, Mrs. (Ma...|
|Rice, Master. Eugene|
|Williams, Mr. Cha...|
|Vander Planke, Mr...|
|Masselmani, Mrs. ...|
+--------------------+
only showing top 20 rows

In [40]:
# 컬럼 속성 활용 시 SELECT 절에서 연산이 가능한 형태가 됨

titanic_sdf['Fare'] * 100

Column<'(Fare * 100)'>

In [44]:
titanic_sdf.select(
    titanic_sdf['Fare'],
    titanic_sdf['Fare']*100
).show()

+-------+-----------------+
|   Fare|     (Fare * 100)|
+-------+-----------------+
|   7.25|            725.0|
|71.2833|          7128.33|
|  7.925|            792.5|
|   53.1|           5310.0|
|   8.05|805.0000000000001|
| 8.4583|845.8299999999999|
|51.8625|          5186.25|
| 21.075|           2107.5|
|11.1333|          1113.33|
|30.0708|          3007.08|
|   16.7|           1670.0|
|  26.55|           2655.0|
|   8.05|805.0000000000001|
| 31.275|           3127.5|
| 7.8542|           785.42|
|   16.0|           1600.0|
| 29.125|           2912.5|
|   13.0|           1300.0|
|   18.0|           1800.0|
|  7.225|            722.5|
+-------+-----------------+
only showing top 20 rows

Spark dataframe에서 컬럼 다룰때 가장 많이 사용하는 방식
- `col`
- Spark SQL에서 사용되는 모든 연산이 들어있는 패키지인 pyspark.sql.functions 에서 import

In [45]:
import pyspark.sql.functions as F

F.col("Fare")

Column<'Fare'>

In [46]:
titanic_sdf.select(
    F.col('Name'),
    F.col('Fare')
).show()

+--------------------+-------+
|                Name|   Fare|
+--------------------+-------+
|Braund, Mr. Owen ...|   7.25|
|Cumings, Mrs. Joh...|71.2833|
|Heikkinen, Miss. ...|  7.925|
|Futrelle, Mrs. Ja...|   53.1|
|Allen, Mr. Willia...|   8.05|
|    Moran, Mr. James| 8.4583|
|McCarthy, Mr. Tim...|51.8625|
|Palsson, Master. ...| 21.075|
|Johnson, Mrs. Osc...|11.1333|
|Nasser, Mrs. Nich...|30.0708|
|Sandstrom, Miss. ...|   16.7|
|Bonnell, Miss. El...|  26.55|
|Saundercock, Mr. ...|   8.05|
|Andersson, Mr. An...| 31.275|
|Vestrom, Miss. Hu...| 7.8542|
|Hewlett, Mrs. (Ma...|   16.0|
|Rice, Master. Eugene| 29.125|
|Williams, Mr. Cha...|   13.0|
|Vander Planke, Mr...|   18.0|
|Masselmani, Mrs. ...|  7.225|
+--------------------+-------+
only showing top 20 rows

In [48]:
titanic_sdf.select(
    F.col('Name'),
    F.upper(F.col('Name')).alias('CAP NAME')
).show()

+--------------------+--------------------+
|                Name|            CAP NAME|
+--------------------+--------------------+
|Braund, Mr. Owen ...|BRAUND, MR. OWEN ...|
|Cumings, Mrs. Joh...|CUMINGS, MRS. JOH...|
|Heikkinen, Miss. ...|HEIKKINEN, MISS. ...|
|Futrelle, Mrs. Ja...|FUTRELLE, MRS. JA...|
|Allen, Mr. Willia...|ALLEN, MR. WILLIA...|
|    Moran, Mr. James|    MORAN, MR. JAMES|
|McCarthy, Mr. Tim...|MCCARTHY, MR. TIM...|
|Palsson, Master. ...|PALSSON, MASTER. ...|
|Johnson, Mrs. Osc...|JOHNSON, MRS. OSC...|
|Nasser, Mrs. Nich...|NASSER, MRS. NICH...|
|Sandstrom, Miss. ...|SANDSTROM, MISS. ...|
|Bonnell, Miss. El...|BONNELL, MISS. EL...|
|Saundercock, Mr. ...|SAUNDERCOCK, MR. ...|
|Andersson, Mr. An...|ANDERSSON, MR. AN...|
|Vestrom, Miss. Hu...|VESTROM, MISS. HU...|
|Hewlett, Mrs. (Ma...|HEWLETT, MRS. (MA...|
|Rice, Master. Eugene|RICE, MASTER. EUGENE|
|Williams, Mr. Cha...|WILLIAMS, MR. CHA...|
|Vander Planke, Mr...|VANDER PLANKE, MR...|
|Masselmani, Mrs. ...|MASSELMANI, MRS. ...|
+--------------------+--------------------+
only showing top 20 rows

In [50]:
titanic_sdf.select(
    F.col('Name'),
    (F.col('Fare') * 100).alias('FARE')
).show()

+--------------------+-----------------+
|                Name|             FARE|
+--------------------+-----------------+
|Braund, Mr. Owen ...|            725.0|
|Cumings, Mrs. Joh...|          7128.33|
|Heikkinen, Miss. ...|            792.5|
|Futrelle, Mrs. Ja...|           5310.0|
|Allen, Mr. Willia...|805.0000000000001|
|    Moran, Mr. James|845.8299999999999|
|McCarthy, Mr. Tim...|          5186.25|
|Palsson, Master. ...|           2107.5|
|Johnson, Mrs. Osc...|          1113.33|
|Nasser, Mrs. Nich...|          3007.08|
|Sandstrom, Miss. ...|           1670.0|
|Bonnell, Miss. El...|           2655.0|
|Saundercock, Mr. ...|805.0000000000001|
|Andersson, Mr. An...|           3127.5|
|Vestrom, Miss. Hu...|           785.42|
|Hewlett, Mrs. (Ma...|           1600.0|
|Rice, Master. Eugene|           2912.5|
|Williams, Mr. Cha...|           1300.0|
|Vander Planke, Mr...|           1800.0|
|Masselmani, Mrs. ...|            722.5|
+--------------------+-----------------+
only showing top 20 rows

# Spark DataFrame의 filter() method 
- SQL의 WHERE절과 매우 흡사
- 조건 컬럼은 컬럼 속성으로 지정 가능
- 조건문 자체는 SQL과 유사한 문자열로 지정. 단, 조건 컬럼은 문자열 지정이 안됨.
- `where` method는 filter의 alias 버전이며, where과 직관적 동일성을 간주하기 위해 생성
- 복합 조건 and는 `&`를, or는 `|`를 사용. 개별 조건은 괄호()로 감싸기.

In [51]:
F.col('Embarked') == "Q"

Column<'(Embarked = Q)'>

In [52]:
titanic_sdf.filter(
    F.col('Embarked') == 'Q'
).show()

+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|Ticket|  Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|330877|8.4583| null|       Q|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|382652|29.125| null|       Q|
|         23|       1|     3|"McGowan, Miss. A...|female|15.0|    0|    0|330923|8.0292| null|       Q|
|         29|       1|     3|"O'Dwyer, Miss. E...|female|null|    0|    0|330959|7.8792| null|       Q|
|         33|       1|     3|Glynn, Miss. Mary...|female|null|    0|    0|335677|  7.75| null|       Q|
|         45|       1|     3|Devaney, Miss. Ma...|female|19.0|    0|    0|330958|7.8792| null|       Q|
|         47|       0|     3|   Lennon, Mr. Denis|  male|null|    1|    0|370371|  15.5| null|       Q|
|         48|       1|     3|O'Driscoll, Miss....|female|null|    0|    0| 14311|  7.75| null|       Q|
|         83|       1|     3|McDermott, Miss. ...|female|null|    0|    0|330932|7.7875| null|       Q|
|        110|       1|     3| Moran, Miss. Bertha|female|null|    1|    0|371110| 24.15| null|       Q|
|        117|       0|     3|Connors, Mr. Patrick|  male|70.5|    0|    0|370369|  7.75| null|       Q|
|        127|       0|     3| McMahon, Mr. Martin|  male|null|    0|    0|370372|  7.75| null|       Q|
|        144|       0|     3| Burke, Mr. Jeremiah|  male|19.0|    0|    0|365222|  6.75| null|       Q|
|        157|       1|     3|"Gilnagh, Miss. K...|female|16.0|    0|    0| 35851|7.7333| null|       Q|
|        172|       0|     3|Rice, Master. Arthur|  male| 4.0|    4|    1|382652|29.125| null|       Q|
|        187|       1|     3|"O'Brien, Mrs. Th...|female|null|    1|    0|370365|  15.5| null|       Q|
|        189|       0|     3|    Bourke, Mr. John|  male|40.0|    1|    1|364849|  15.5| null|       Q|
|        197|       0|     3| Mernagh, Mr. Robert|  male|null|    0|    0|368703|  7.75| null|       Q|
|        199|       1|     3|"Madigan, Miss. M...|female|null|    0|    0|370370|  7.75| null|       Q|
|        209|       1|     3|"Carr, Miss. Hele...|female|16.0|    0|    0|367231|  7.75| null|       Q|
+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
only showing top 20 rows

In [53]:
titanic_sdf.where(
    F.col('Embarked') == 'Q'
).show()

+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|Ticket|  Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|330877|8.4583| null|       Q|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|382652|29.125| null|       Q|
|         23|       1|     3|"McGowan, Miss. A...|female|15.0|    0|    0|330923|8.0292| null|       Q|
|         29|       1|     3|"O'Dwyer, Miss. E...|female|null|    0|    0|330959|7.8792| null|       Q|
|         33|       1|     3|Glynn, Miss. Mary...|female|null|    0|    0|335677|  7.75| null|       Q|
|         45|       1|     3|Devaney, Miss. Ma...|female|19.0|    0|    0|330958|7.8792| null|       Q|
|         47|       0|     3|   Lennon, Mr. Denis|  male|null|    1|    0|370371|  15.5| null|       Q|
|         48|       1|     3|O'Driscoll, Miss....|female|null|    0|    0| 14311|  7.75| null|       Q|
|         83|       1|     3|McDermott, Miss. ...|female|null|    0|    0|330932|7.7875| null|       Q|
|        110|       1|     3| Moran, Miss. Bertha|female|null|    1|    0|371110| 24.15| null|       Q|
|        117|       0|     3|Connors, Mr. Patrick|  male|70.5|    0|    0|370369|  7.75| null|       Q|
|        127|       0|     3| McMahon, Mr. Martin|  male|null|    0|    0|370372|  7.75| null|       Q|
|        144|       0|     3| Burke, Mr. Jeremiah|  male|19.0|    0|    0|365222|  6.75| null|       Q|
|        157|       1|     3|"Gilnagh, Miss. K...|female|16.0|    0|    0| 35851|7.7333| null|       Q|
|        172|       0|     3|Rice, Master. Arthur|  male| 4.0|    4|    1|382652|29.125| null|       Q|
|        187|       1|     3|"O'Brien, Mrs. Th...|female|null|    1|    0|370365|  15.5| null|       Q|
|        189|       0|     3|    Bourke, Mr. John|  male|40.0|    1|    1|364849|  15.5| null|       Q|
|        197|       0|     3| Mernagh, Mr. Robert|  male|null|    0|    0|368703|  7.75| null|       Q|
|        199|       1|     3|"Madigan, Miss. M...|female|null|    0|    0|370370|  7.75| null|       Q|
|        209|       1|     3|"Carr, Miss. Hele...|female|16.0|    0|    0|367231|  7.75| null|       Q|
+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
only showing top 20 rows

In [55]:
# AND -> &
titanic_sdf.filter(
    (F.col('Embarked') == 'Q') & (F.col('Pclass') == 1)
).show()

+-----------+--------+------+--------------------+------+----+-----+-----+------+----+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|Ticket|Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+------+----+-----+--------+
|        246|       0|     1|Minahan, Dr. Will...|  male|44.0|    2|    0| 19928|90.0|  C78|       Q|
|        413|       1|     1|Minahan, Miss. Da...|female|33.0|    1|    0| 19928|90.0|  C78|       Q|
+-----------+--------+------+--------------------+------+----+-----+-----+------+----+-----+--------+

In [56]:
# OR -> |
titanic_sdf.filter(
    (F.col('Embarked') == 'Q') | (F.col('Pclass') == 1)
).show()

+-----------+--------+------+--------------------+------+----+-----+-----+--------+--------+-----------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|  Ticket|    Fare|      Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+--------+--------+-----------+--------+
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|PC 17599| 71.2833|        C85|       C|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|  113803|    53.1|       C123|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|  330877|  8.4583|       null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|   17463| 51.8625|        E46|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|  113783|   26.55|       C103|       S|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|  382652|  29.125|       null|       Q|
|         23|       1|     3|"McGowan, Miss. A...|female|15.0|    0|    0|  330923|  8.0292|       null|       Q|
|         24|       1|     1|Sloper, Mr. Willi...|  male|28.0|    0|    0|  113788|    35.5|         A6|       S|
|         28|       0|     1|Fortune, Mr. Char...|  male|19.0|    3|    2|   19950|   263.0|C23 C25 C27|       S|
|         29|       1|     3|"O'Dwyer, Miss. E...|female|null|    0|    0|  330959|  7.8792|       null|       Q|
|         31|       0|     1|Uruchurtu, Don. M...|  male|40.0|    0|    0|PC 17601| 27.7208|       null|       C|
|         32|       1|     1|Spencer, Mrs. Wil...|female|null|    1|    0|PC 17569|146.5208|        B78|       C|
|         33|       1|     3|Glynn, Miss. Mary...|female|null|    0|    0|  335677|    7.75|       null|       Q|
|         35|       0|     1|Meyer, Mr. Edgar ...|  male|28.0|    1|    0|PC 17604| 82.1708|       null|       C|
|         36|       0|     1|Holverson, Mr. Al...|  male|42.0|    1|    0|  113789|    52.0|       null|       S|
|         45|       1|     3|Devaney, Miss. Ma...|female|19.0|    0|    0|  330958|  7.8792|       null|       Q|
|         47|       0|     3|   Lennon, Mr. Denis|  male|null|    1|    0|  370371|    15.5|       null|       Q|
|         48|       1|     3|O'Driscoll, Miss....|female|null|    0|    0|   14311|    7.75|       null|       Q|
|         53|       1|     1|Harper, Mrs. Henr...|female|49.0|    1|    0|PC 17572| 76.7292|        D33|       C|
|         55|       0|     1|Ostby, Mr. Engelh...|  male|65.0|    0|    1|  113509| 61.9792|        B30|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+--------+--------+-----------+--------+
only showing top 20 rows

In [57]:
# LIKE
titanic_sdf.filter(
    F.col('Name').like('%Miss%')
).show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         23|       1|     3|"McGowan, Miss. A...|female|15.0|    0|    0|          330923| 8.0292| null|       Q|
|         25|       0|     3|Palsson, Miss. To...|female| 8.0|    3|    1|          349909| 21.075| null|       S|
|         29|       1|     3|"O'Dwyer, Miss. E...|female|null|    0|    0|          330959| 7.8792| null|       Q|
|         33|       1|     3|Glynn, Miss. Mary...|female|null|    0|    0|          335677|   7.75| null|       Q|
|         39|       0|     3|Vander Planke, Mi...|female|18.0|    2|    0|          345764|   18.0| null|       S|
|         40|       1|     3|Nicola-Yarred, Mi...|female|14.0|    1|    0|            2651|11.2417| null|       C|
|         44|       1|     2|Laroche, Miss. Si...|female| 3.0|    1|    2|   SC/Paris 2123|41.5792| null|       C|
|         45|       1|     3|Devaney, Miss. Ma...|female|19.0|    0|    0|          330958| 7.8792| null|       Q|
|         48|       1|     3|O'Driscoll, Miss....|female|null|    0|    0|           14311|   7.75| null|       Q|
|         57|       1|     2|   Rugg, Miss. Emily|female|21.0|    0|    0|      C.A. 31026|   10.5| null|       S|
|         59|       1|     2|West, Miss. Const...|female| 5.0|    1|    2|      C.A. 34651|  27.75| null|       S|
|         62|       1|     1| Icard, Miss. Amelie|female|38.0|    0|    0|          113572|   80.0|  B28|    null|
|         69|       1|     3|Andersson, Miss. ...|female|17.0|    4|    2|         3101281|  7.925| null|       S|
|         72|       0|     3|Goodwin, Miss. Li...|female|16.0|    5|    2|         CA 2144|   46.9| null|       S|
|         80|       1|     3|Dowdell, Miss. El...|female|30.0|    0|    0|          364516| 12.475| null|       S|
|         83|       1|     3|McDermott, Miss. ...|female|null|    0|    0|          330932| 7.7875| null|       Q|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [61]:
# SQL 조건문 작성 하듯이 사용 가능 - 추천 안함
titanic_sdf.filter(
    "Name like '%Miss%'"
).show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         23|       1|     3|"McGowan, Miss. A...|female|15.0|    0|    0|          330923| 8.0292| null|       Q|
|         25|       0|     3|Palsson, Miss. To...|female| 8.0|    3|    1|          349909| 21.075| null|       S|
|         29|       1|     3|"O'Dwyer, Miss. E...|female|null|    0|    0|          330959| 7.8792| null|       Q|
|         33|       1|     3|Glynn, Miss. Mary...|female|null|    0|    0|          335677|   7.75| null|       Q|
|         39|       0|     3|Vander Planke, Mi...|female|18.0|    2|    0|          345764|   18.0| null|       S|
|         40|       1|     3|Nicola-Yarred, Mi...|female|14.0|    1|    0|            2651|11.2417| null|       C|
|         44|       1|     2|Laroche, Miss. Si...|female| 3.0|    1|    2|   SC/Paris 2123|41.5792| null|       C|
|         45|       1|     3|Devaney, Miss. Ma...|female|19.0|    0|    0|          330958| 7.8792| null|       Q|
|         48|       1|     3|O'Driscoll, Miss....|female|null|    0|    0|           14311|   7.75| null|       Q|
|         57|       1|     2|   Rugg, Miss. Emily|female|21.0|    0|    0|      C.A. 31026|   10.5| null|       S|
|         59|       1|     2|West, Miss. Const...|female| 5.0|    1|    2|      C.A. 34651|  27.75| null|       S|
|         62|       1|     1| Icard, Miss. Amelie|female|38.0|    0|    0|          113572|   80.0|  B28|    null|
|         69|       1|     3|Andersson, Miss. ...|female|17.0|    4|    2|         3101281|  7.925| null|       S|
|         72|       0|     3|Goodwin, Miss. Li...|female|16.0|    5|    2|         CA 2144|   46.9| null|       S|
|         80|       1|     3|Dowdell, Miss. El...|female|30.0|    0|    0|          364516| 12.475| null|       S|
|         83|       1|     3|McDermott, Miss. ...|female|null|    0|    0|          330932| 7.7875| null|       Q|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

```SQL
SELECT upper(Name)
FROM titanic_sdf
WHERE lower(Name) like 'h%'
```

In [70]:
# 소문자 h로 시작하는 이름 조회 -> 대문자로 출력

titanic_sdf.filter(
    F.lower(F.col('Name')).like('h%')
).select(
    F.upper(F.col('Name')).alias('NAME')
).show()

+--------------------+
|                NAME|
+--------------------+
|HEIKKINEN, MISS. ...|
|HEWLETT, MRS. (MA...|
|HOLVERSON, MR. AL...|
|HARPER, MRS. HENR...|
|HARRIS, MR. HENRY...|
|HOOD, MR. AMBROSE JR|
|HICKMAN, MR. STAN...|
|HAKKARAINEN, MRS....|
|  HALE, MR. REGINALD|
|HONKANEN, MISS. E...|
|  HARRIS, MR. WALTER|
|HOYT, MR. FREDERI...|
|HARRIS, MRS. HENR...|
|HARKNETT, MISS. A...|
|   HOLD, MR. STEPHEN|
|HUNT, MR. GEORGE ...|
|HAMALAINEN, MRS. ...|
|HARRISON, MR. WIL...|
|  HENRY, MISS. DELIA|
|HOSONO, MR. MASABUMI|
+--------------------+
only showing top 20 rows

In [71]:
spark.stop()